TexasInstruments/mcupsdk-core/examples/drivers/adc/adc_ppb_epwm_trip/am263x-lp/r5fss0-0_nortos/example.syscfg
epwm_xbar1.$name      = "CONFIG_EPWM_XBAR0";
epwm_xbar1.instance   = "EPWM_XBAR_6";
epwm_xbar1.xbarOutput = ["ADC0_EVT1"];

epwm_xbar2.$name      = "CONFIG_EPWM_XBAR1";
epwm_xbar2.xbarOutput = ["ADC0_EVT1"];
epwm_xbar2.instance   = "EPWM_XBAR_7";

epwm_xbar3.$name      = "CONFIG_EPWM_XBAR2";
epwm_xbar3.xbarOutput = ["ADC0_EVT1"];
epwm_xbar3.instance   = "EPWM_XBAR_8";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC0_INT1"];

int_xbar2.$name      = "CONFIG_INT_XBAR1";
int_xbar2.xbarOutput = ["ADC0_EVTINT"];
int_xbar2.instance   = "INT_XBAR_1";

output_xbar1.$name                         = "CONFIG_OUTPUT_XBAR0";
output_xbar1.xbarOutput                    = ["EPWM2_TRIPOUT"];
output_xbar1.OUTPUTXBAR.$assign            = "OUTPUTXBAR1";
output_xbar1.OUTPUTXBAR.OUTPUTXBAR.$assign = "SPI1_CS0";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN0.$suggestSolution = "ADC0_AIN0";
adc1.ADC.AIN1.$suggestSolution = "ADC0_AIN1";
adc1.ADC.AIN2.$suggestSolution = "ADC0_AIN2";
adc1.ADC.AIN3.$suggestSolution = "ADC0_AIN3";
adc1.ADC.AIN4.$suggestSolution = "ADC0_AIN4";
adc1.ADC.AIN5.$suggestSolution = "ADC0_AIN5";
epwm1.EPWM.A.$suggestSolution  = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution  = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution  = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution  = "EPWM1_B";
epwm3.EPWM.$suggestSolution    = "EPWM2";
epwm3.EPWM.A.$suggestSolution  = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution  = "EPWM2_B";
